micropython/micropython/ports/esp32/machine_pwm.c
// This called from Ctrl-D soft reboot
void machine_pwm_deinit_all(void) {
    if (pwm_inited) {
        for (int mode = 0; mode < LEDC_SPEED_MODE_MAX; ++mode) {
            for (int channel = 0; channel < LEDC_CHANNEL_MAX; ++channel) {
                pwm_deinit(mode, channel);
            }
        }
        pwm_inited = false;
    }
}

static void configure_channel(machine_pwm_obj_t *self) {
    ledc_channel_config_t cfg = {
        .channel = self->channel,
        .duty = self->channel_duty,
        .gpio_num = self->pin,
        .intr_type = LEDC_INTR_DISABLE,
        .speed_mode = self->mode,
        .timer_sel = self->timer,
        .flags.output_invert = self->output_invert,
    };
    ledc_timer_config_t *timer = &timers[self->mode][self->timer];
    if (self->channel_duty == MAX_TIMER_DUTY) {
        cfg.duty = 0;
        cfg.flags.output_invert = self->output_invert ^ 1;
    }
    check_esp_err(ledc_channel_config(&cfg));

    // reconfigure PWM pin output as input/output
    gpio_set_direction(self->pin, GPIO_MODE_INPUT_OUTPUT);
    if (self->mode == LEDC_LOW_SPEED_MODE) {
        esp_rom_gpio_connect_out_signal(self->pin, LEDC_LS_SIG_OUT0_IDX + self->channel, self->output_invert, false);
    #if SOC_LEDC_SUPPORT_HS_MODE
    } else if (self->mode == LEDC_HIGH_SPEED_MODE) {
        esp_rom_gpio_connect_out_signal(self->pin, LEDC_HS_SIG_OUT0_IDX + self->channel, self->output_invert, false);
    #endif
    }
}

static unsigned int calc_divider(uint32_t src_clk_freq, uint32_t timer_freq) {
    unsigned int divider = (src_clk_freq + timer_freq / 2) / timer_freq; // rounded
    if (divider == 0) {
        divider = 1;
    }
    return divider;
}

// Temporary workaround for ledc_find_suitable_duty_resolution function only being added in IDF V5.2
#if ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5, 2, 0)
static uint32_t ledc_find_suitable_duty_resolution(uint32_t src_clk_freq, uint32_t timer_freq) {
    // This implementation is based on the one used in Micropython v1.23

    // Find the highest bit resolution for the requested frequency
    unsigned int freq = src_clk_freq;
    unsigned int divider = calc_divider(freq, timer_freq);
    float f = (float)freq / divider; // actual frequency
    if (f <= 1.0) {
        f = 1.0;
    }
    freq = (unsigned int)roundf((float)freq / f);

    unsigned int res = 0;
    for (; freq > 1; freq >>= 1) {
        ++res;
    }
    return res;
}
#endif

static uint32_t find_suitable_duty_resolution(uint32_t src_clk_freq, uint32_t timer_freq) {
    unsigned int res = ledc_find_suitable_duty_resolution(src_clk_freq, timer_freq);
    debug_printf("ledc_find_suitable_duty_resolution=%d", res)
    if (res == 0) {
        res = 1;
    } else if (res > HIGHEST_PWM_RES) {
        // Limit resolution to HIGHEST_PWM_RES to match units of our duty
        res = HIGHEST_PWM_RES;
    }
    return res;
}

static void pwm_is_active(machine_pwm_obj_t *self) {
    if (self->timer < 0) {
        mp_raise_msg(&mp_type_RuntimeError, MP_ERROR_TEXT("PWM is inactive"));
    }
}

// Calculate the duty parameters based on an ns value
static int ns_to_duty(machine_pwm_obj_t *self, int ns) {
    pwm_is_active(self);
    ledc_timer_config_t *timer = &timers[self->mode][self->timer];
    int64_t duty = ((int64_t)ns * MAX_DUTY_UI16 * timer->freq_hz + 500000000LL) / 1000000000LL;
    if ((ns > 0) && (duty == 0)) {
        duty = 1;
    } else if (duty > MAX_DUTY_UI16) {
        duty = MAX_DUTY_UI16;
    }
    return duty;
}

static int duty_to_ns(machine_pwm_obj_t *self, int duty) {
    pwm_is_active(self);
    ledc_timer_config_t *timer = &timers[self->mode][self->timer];
    int64_t ns = ((int64_t)duty * 1000000000LL + (int64_t)timer->freq_hz * MAX_DUTY_UI16 / 2) / ((int64_t)timer->freq_hz * MAX_DUTY_UI16);
    return ns;
}

#define get_duty_raw(self) ledc_get_duty(self->mode, self->channel)

static uint32_t get_duty_u16(machine_pwm_obj_t *self) {
    pwm_is_active(self);
    ledc_timer_config_t *timer = &timers[self->mode][self->timer];
    debug_printf("MAX_TIMER_DUTY=%d timer->duty_resolution=%d self->channel_duty=%d get_duty_raw()=%d", MAX_TIMER_DUTY, timer->duty_resolution, self->channel_duty, get_duty_raw(self))

    if ((self->channel_duty == MAX_TIMER_DUTY) || (get_duty_raw(self) >= MAX_TIMER_DUTY)) {
        return MAX_DUTY_UI16;
    } else {
        int resolution = timers[self->mode][self->timer].duty_resolution;
        debug_printf("resolution=%d get_duty_raw()=%d", resolution, get_duty_raw(self));
        if (resolution <= UI_RES_16_BIT) {
            return get_duty_raw(self) << (UI_RES_16_BIT - resolution);
        } else {
            return get_duty_raw(self) >> (resolution - UI_RES_16_BIT);
        }
    }
}

static uint32_t get_duty_u10(machine_pwm_obj_t *self) {
    return get_duty_u16(self) >> (UI_RES_16_BIT - UI_RES_10_BIT); // Scale down from 16 bit to 10 bit resolution
}

static uint32_t get_duty_ns(machine_pwm_obj_t *self) {
    return duty_to_ns(self, get_duty_u16(self));
}
/*
static void apply_duty(machine_pwm_obj_t *self) {
    pwm_is_active(self);
    ledc_timer_config_t *timer = &timers[self->mode][self->timer];
    int duty = 0;
    if (self->duty_x == UI_RES_16_BIT) {
        duty = self->duty_ui;
    } else if (self->duty_x == UI_RES_10_BIT) {
        duty = self->duty_ui << (UI_RES_16_BIT - UI_RES_10_BIT);
    } else if (self->duty_x == -UI_RES_16_BIT) {
        duty = ns_to_duty(self, self->duty_ui);
    }
    int channel_duty;
    if (timer->duty_resolution <= UI_RES_16_BIT) {
        channel_duty = duty >> (UI_RES_16_BIT - timer->duty_resolution);
    } else {
        channel_duty = duty << (timer->duty_resolution - UI_RES_16_BIT);
    }
    if (channel_duty < 0) {
        channel_duty = 0;
    } else if (channel_duty > MAX_TIMER_DUTY) {
        channel_duty = MAX_TIMER_DUTY;
    }
    check_esp_err(ledc_set_duty(self->mode, self->channel, channel_duty));
    check_esp_err(ledc_update_duty(self->mode, self->channel));
    self->channel_duty = channel_duty;
}
*/
static void set_duty_u16(machine_pwm_obj_t *self, int duty) {
    if ((duty < 0) || (duty > MAX_DUTY_UI16)) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("duty_u16 must be from 0 to %d"), MAX_DUTY_UI16);
    }

